Revit 2024 API
Leader.Anchor Property
 Anchor point of the Leader
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ Anchor { get; }
Visual Basic
Public ReadOnly Property Anchor As XYZ
	Get
Visual C++
public:
property XYZ^ Anchor {
	XYZ^ get ();
}
Remarks
 Anchor is the leader's point that is attached to an annotation (a tag, note, etc.) This is a read-only property, for the this point gets always computed based on various properties of the annotation element.
See Also
Leader Class
Autodesk.Revit.DB Namespace